[
  {
    "plantId": 1,
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 18,
    "rating": 4.8,
    "description": "A hardy, resilient indoor plant renowned for its exceptional air-purifying qualities, effectively filtering out common household toxins such as formaldehyde and benzene. The Snake Plant features tall, upright, sword-like leaves with striking green and yellow variegation, adding a modern and architectural touch to any space. It thrives in low-light conditions and requires minimal watering, making it an ideal choice for beginners or those with busy lifestyles. Its ability to release oxygen at night also makes it a great bedroom companion for improving sleep quality.",
    "image": "https://i.postimg.cc/fy2g5JXP/still-life-with-indoor-plants.jpg",
    "availableStock": 10,
    "careLevel": "Easy",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 2,
    "plantName": "ZZ Plant",
    "category": "Low-Maintenance",
    "price": 22,
    "rating": 4.7,
    "description": "The ZZ Plant is an incredibly durable and low-maintenance houseplant, perfect for offices or homes with inconsistent lighting and watering schedules. It boasts glossy, dark green, waxy leaves that grow in a graceful, upright pattern from thick rhizomes that store water—allowing it to survive long periods of drought. Highly tolerant of low light and neglect, this plant is also known for its air-purifying properties and sleek, modern aesthetic that complements any interior design style.",
    "image": "https://i.postimg.cc/7ZqP4H8T/zz-plant-new.jpg",
    "availableStock": 15,
    "careLevel": "Easy",
    "providerName": "GreenLeaf Nursery"
  },
  {
    "plantId": 3,
    "plantName": "Pothos",
    "category": "Trailing Plant",
    "price": 15,
    "rating": 4.6,
    "description": "Pothos, also known as Devil’s Ivy, is one of the most beloved and easy-to-grow trailing houseplants. With its heart-shaped, vibrant green leaves—often variegated with splashes of yellow or white—it adds lush, cascading greenery to shelves, hanging baskets, or tabletops. Extremely adaptable, Pothos thrives in a wide range of lighting conditions and can go weeks without water. It’s also an excellent air purifier and can be easily propagated in water, making it perfect for plant enthusiasts of all experience levels.",
    "image": "https://i.postimg.cc/JnX3p0vS/pothos-new.jpg",
    "availableStock": 20,
    "careLevel": "Easy",
    "providerName": "The Sill"
  },
  {
    "plantId": 4,
    "plantName": "Monstera Deliciosa",
    "category": "Statement Plant",
    "price": 35,
    "rating": 4.9,
    "description": "The Monstera Deliciosa, often called the Swiss Cheese Plant, is a bold and iconic tropical houseplant known for its enormous, glossy, perforated leaves that develop dramatic splits as the plant matures. Native to the rainforests of Central America, it brings a lush, jungle-like ambiance to any room. While it prefers bright, indirect light and consistent moisture, it’s relatively forgiving and grows quickly under the right conditions. Its sculptural form and photogenic appeal have made it a favorite among interior designers and plant lovers alike.",
    "image": "https://i.postimg.cc/4xG6Yk2W/monstera-new.jpg",
    "availableStock": 5,
    "careLevel": "Medium",
    "providerName": "Bloomscape"
  },
  {
    "plantId": 5,
    "plantName": "Fiddle Leaf Fig",
    "category": "Statement Plant",
    "price": 45,
    "rating": 4.5,
    "description": "The Fiddle Leaf Fig is a stunning indoor tree prized for its large, violin-shaped, leathery leaves that create a dramatic vertical statement in any space. Originating from tropical West Africa, it thrives in bright, filtered light and appreciates consistent humidity and watering. Though it can be finicky and sensitive to environmental changes, its bold silhouette and architectural elegance make it a top choice for stylish, modern interiors. With proper care and patience, it becomes a long-lasting centerpiece in homes and offices.",
    "image": "https://i.postimg.cc/0Q7W2X9P/fiddle-leaf-fig-new.jpg",
    "availableStock": 3,
    "careLevel": "Hard",
    "providerName": "Greenery NYC"
  },
  {
    "plantId": 6,
    "plantName": "Spider Plant",
    "category": "Air Purifier",
    "price": 12,
    "rating": 4.7,
    "description": "The Spider Plant is a classic, fast-growing houseplant celebrated for its air-purifying abilities and easy-going nature. It features long, arching leaves with green and white stripes and produces tiny offshoots, or 'spiderettes,' that dangle from long stems—making it perfect for hanging planters. NASA even lists it among the top plants for removing indoor air pollutants like carbon monoxide and xylene. Extremely adaptable, it tolerates a range of light conditions and irregular watering, and it’s safe for pets, making it ideal for families and beginners.",
    "image": "https://i.postimg.cc/NfY2bJ6M/spider-plant-new.jpg",
    "availableStock": 25,
    "careLevel": "Easy",
    "providerName": "Plant Collective"
  },
  {
    "plantId": 7,
    "plantName": "Peace Lily",
    "category": "Air Purifier",
    "price": 25,
    "rating": 4.6,
    "description": "The Peace Lily is an elegant and sophisticated houseplant known for its lush, dark green foliage and graceful white blooms that resemble calla lilies. Beyond its beauty, it’s a powerful air purifier, effectively removing toxins such as ammonia, benzene, and formaldehyde from indoor environments. It thrives in medium to low indirect light and prefers consistently moist soil, often drooping slightly as a gentle reminder when it needs water. Its combination of aesthetic appeal, air-cleaning power, and relative ease of care makes it a favorite for homes and offices alike.",
    "image": "https://i.postimg.cc/4N1H8Q2K/peace-lily-new.jpg",
    "availableStock": 12,
    "careLevel": "Medium",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 8,
    "plantName": "Aloe Vera",
    "category": "Medicinal",
    "price": 14,
    "rating": 4.5,
    "description": "Aloe Vera is a versatile and practical succulent valued not only for its striking architectural form but also for its healing properties. Its thick, fleshy leaves store a clear gel rich in vitamins, enzymes, and antioxidants—commonly used to soothe sunburns, minor cuts, and skin irritations. This low-maintenance plant thrives in bright, indirect sunlight and requires infrequent watering, making it perfect for sunny windowsills. With its medicinal benefits and sculptural beauty, Aloe Vera is both a functional and decorative addition to any home.",
    "image": "https://i.postimg.cc/8C2X9W3F/aloe-vera-new.jpg",
    "availableStock": 18,
    "careLevel": "Easy",
    "providerName": "GreenLeaf Nursery"
  },
  {
    "plantId": 9,
    "plantName": "Philodendron Brasil",
    "category": "Trailing Plant",
    "price": 17,
    "rating": 4.7,
    "description": "The Philodendron Brasil is a vibrant and fast-growing trailing vine that brings a pop of color to any indoor space with its heart-shaped leaves featuring bright lime-green variegation against a deep green background. Extremely easy to care for, it adapts well to a variety of lighting conditions—from low to bright indirect light—and tolerates occasional missed waterings. Its trailing habit makes it perfect for hanging baskets or climbing up a moss pole, and it’s simple to propagate, allowing you to share or expand your collection with ease.",
    "image": "https://i.postimg.cc/V6Q3kP8Z/philodendron-brasil-new.jpg",
    "availableStock": 22,
    "careLevel": "Easy",
    "providerName": "The Sill"
  },
  {
    "plantId": 10,
    "plantName": "Calathea Orbifolia",
    "category": "Decorative Foliage",
    "price": 32,
    "rating": 4.8,
    "description": "The Calathea Orbifolia is a show-stopping tropical plant admired for its enormous, round leaves marked with silvery-green stripes that shimmer in the light. Native to Bolivia, it thrives in warm, humid environments with consistent moisture and bright, indirect light—making it a perfect candidate for bathrooms or kitchens with good natural light. Like other prayer plants, its leaves move throughout the day, folding upward at night in a mesmerizing display of natural rhythm. While it demands more attention than easy-care plants, its breathtaking foliage rewards dedicated plant parents with unmatched visual drama.",
    "image": "https://i.postimg.cc/5tV7N2rY/calathea-orbifolia-new.jpg",
    "availableStock": 7,
    "careLevel": "Hard",
    "providerName": "Bloomscape"
  },
  {
    "plantId": 11,
    "plantName": "Chinese Evergreen",
    "category": "Low-Maintenance",
    "price": 20,
    "rating": 4.6,
    "description": "The Chinese Evergreen is a remarkably tolerant and low-maintenance houseplant that flourishes in low-light conditions and with infrequent watering—ideal for dim corners or offices with fluorescent lighting. Its elongated leaves come in a variety of patterns, often featuring silvery or creamy variegation against deep green backgrounds, adding subtle elegance to any room. Additionally, it’s recognized by NASA as an effective air purifier, removing indoor pollutants like benzene and formaldehyde. Its resilience, beauty, and adaptability make it a reliable choice for novice and experienced plant owners alike.",
    "image": "https://i.postimg.cc/0yH3Z8K7/chinese-evergreen-new.jpg",
    "availableStock": 14,
    "careLevel": "Easy",
    "providerName": "Plant Collective"
  },
  {
    "plantId": 12,
    "plantName": "Rubber Plant",
    "category": "Statement Plant",
    "price": 38,
    "rating": 4.7,
    "description": "The Rubber Plant, or Ficus elastica, is a bold and statuesque indoor tree with thick, leathery leaves that range from deep green to burgundy, depending on the variety. Its upright growth habit and glossy foliage give it a polished, modern look that complements contemporary interiors. While it prefers bright, indirect light and moderate watering, it’s relatively forgiving and can adapt to lower light over time. With proper care, it grows tall and full, serving as a living sculpture and natural room divider that adds both style and serenity to your space.",
    "image": "https://i.postimg.cc/7YkP6J2T/rubber-plant-new.jpg",
    "availableStock": 6,
    "careLevel": "Medium",
    "providerName": "Greenery NYC"
  },
  {
    "plantId": 13,
    "plantName": "String of Pearls",
    "category": "Trailing Plant",
    "price": 19,
    "rating": 4.5,
    "description": "The String of Pearls is a uniquely captivating succulent with delicate, trailing stems adorned with small, bead-like leaves that resemble a string of green pearls. Native to arid regions of Africa, it stores water in its round leaves, requiring minimal watering and thriving in bright, indirect light. Its unusual form makes it a standout in hanging planters or cascading over shelves, adding whimsical texture to any plant collection. While it demands careful attention to avoid overwatering, its striking appearance and low-growing habit make it a favorite among succulent enthusiasts.",
    "image": "https://i.postimg.cc/4xJ9W3Q8/string-of-pearls-new.jpg",
    "availableStock": 9,
    "careLevel": "Medium",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 14,
    "plantName": "Boston Fern",
    "category": "Air Purifier",
    "price": 23,
    "rating": 4.4,
    "description": "The Boston Fern is a classic, lush houseplant known for its feathery, arching fronds that create a soft, flowing silhouette. It excels in humid environments like bathrooms or kitchens and prefers consistently moist soil and filtered, indirect light. Renowned for its air-purifying capabilities, it helps remove indoor pollutants such as formaldehyde and xylene while also increasing humidity levels—making it beneficial for both air quality and respiratory health. Though it requires more attentive care than hardier plants, its graceful beauty and natural air-filtering properties make it a timeless favorite.",
    "image": "https://i.postimg.cc/3JqV7H9P/boston-fern-new.jpg",
    "availableStock": 11,
    "careLevel": "Hard",
    "providerName": "GreenLeaf Nursery"
  },
  {
    "plantId": 15,
    "plantName": "Jade Plant",
    "category": "Succulent",
    "price": 16,
    "rating": 4.6,
    "description": "The Jade Plant, often called the 'money plant' or 'lucky plant,' is a symbol of good fortune and prosperity in many cultures. It features thick, woody stems and smooth, oval-shaped leaves that range from rich green to red-tinged, depending on light exposure. As a succulent, it stores water in its leaves and stems, requiring minimal watering and thriving in bright, sunny windows. With its tree-like structure and longevity—some specimens live for decades—it’s a meaningful and low-maintenance addition to any home or office, especially for those seeking both beauty and symbolism.",
    "image": "https://i.postimg.cc/8P3X6W2N/jade-plant-new.jpg",
    "availableStock": 20,
    "careLevel": "Easy",
    "providerName": "The Sill"
  },
  {
    "plantId": 16,
    "plantName": "Bird of Paradise",
    "category": "Statement Plant",
    "price": 55,
    "rating": 4.9,
    "description": "The Bird of Paradise is a majestic, tropical statement plant that brings the drama and grandeur of a rainforest into your home. Its enormous, paddle-shaped leaves grow in a fan-like arrangement, resembling a banana tree, and mature specimens can even produce exotic orange and blue flowers that look like tropical birds in flight. It thrives in bright, direct to indirect sunlight and appreciates high humidity and consistent moisture. Though it demands more care and space than average houseplants, its bold silhouette and exotic flair make it a showstopper in spacious, sun-drenched rooms.",
    "image": "https://i.postimg.cc/4N8Y2K7M/bird-of-paradise-new.jpg",
    "availableStock": 2,
    "careLevel": "Hard",
    "providerName": "Bloomscape"
  }
]
